/* tinyplay.c
**
** Copyright 2011, The Android Open Source Project
** Copyright 2026, Artyom <https://github.com/ortom-io>
**
** Redistribution and use in source and binary forms, with or without
** modification, are permitted provided that the following conditions are met:
**     * Redistributions of source code must retain the above copyright
**       notice, this list of conditions and the following disclaimer.
**     * Redistributions in binary form must reproduce the above copyright
**       notice, this list of conditions and the following disclaimer in the
**       documentation and/or other materials provided with the distribution.
**     * Neither the name of The Android Open Source Project nor the names of
**       its contributors may be used to endorse or promote products derived
**       from this software without specific prior written permission.
**
** THIS SOFTWARE IS PROVIDED BY The Android Open Source Project ``AS IS'' AND
** ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
** IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
** ARE DISCLAIMED. IN NO EVENT SHALL The Android Open Source Project BE LIABLE
** FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
** DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
** SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
** CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
** LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
** OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
** DAMAGE.
*/

#define _GNU_SOURCE
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <signal.h>
#include <errno.h>
#include <unistd.h>
#include <fcntl.h>
#include <ctype.h>
#include <dirent.h>
#include <sched.h>
#include <time.h>
#include <sys/mman.h>
#include <sys/stat.h>
#include <sys/resource.h>
#include <sys/syscall.h>
#include <sys/prctl.h>
#include <sys/mount.h>
#include <sys/types.h>
#include <sys/wait.h>
#include <assert.h>
#include <stdatomic.h>
#include <linux/futex.h>
#include <sys/time.h>
#include <pthread.h>
#include <sys/ioctl.h>
#include <alsa/asoundlib.h>
#include <sys/eventfd.h>
#include <poll.h>
#include <sys/inotify.h>
#include <limits.h>
#include <stdalign.h>


/* Wrapper for direct system call */
static long
sys_futex(void *addr1, int op, int val1, const struct timespec *timeout, void *addr2, int val3)
{
    return syscall(SYS_futex, addr1, op, val1, timeout, addr2, val3);
}

/* Fallback definitions for older headers */
#ifndef FUTEX_WAIT
#define FUTEX_WAIT 0
#endif
#ifndef FUTEX_WAKE
#define FUTEX_WAKE 1
#endif

#define OPTPARSE_IMPLEMENTATION
#include "optparse.h"

#ifndef likely
#define likely(x)      __builtin_expect(!!(x), 1)
#endif

#ifndef unlikely
#define unlikely(x)    __builtin_expect(!!(x), 0)
#endif

#ifndef SNDRV_PCM_IOCTL_DELAY
#define SNDRV_PCM_IOCTL_DELAY _IOR('A', 0x21, snd_pcm_sframes_t)
#endif

/* --- CONFIGURATION --- */
#define DEFAULT_SHM_FILE "/mnt/nlp/tinyplay_shm"
#define SHIELD_DIR       "/mnt/nlp/tmp"
#define MY_BUNKER        "tiny_shield"
#define MAX_STATE_ENTRIES 2048

static char g_cpuset_root[128] = "/dev/cpuset";

/* Commands & States */
#define CMD_NONE 0
#define CMD_PAUSE 1
#define CMD_RESUME 2
#define CMD_SEEK 3
#define CMD_EXIT 4
#define CMD_UPDATE_TIME 5
#define STATE_PLAYING 0
#define STATE_PAUSED 1
#define STATE_COMPLETED 2
#define STATE_ERROR 3
#define STATE_DRAINING 4

/* Standard WAV Defines */
#define ID_RIFF 0x46464952
#define ID_WAVE 0x45564157
#define ID_FMT  0x20746d66
#define ID_DATA 0x61746164
#define WAVE_FORMAT_PCM 0x0001
#define WAVE_FORMAT_IEEE_FLOAT 0x0003

/* Priority Defines */
#ifndef IOPRIO_CLASS_RT
#define IOPRIO_CLASS_RT 1
#endif
#ifndef IOPRIO_WHO_PROCESS
#define IOPRIO_WHO_PROCESS 1
#endif
#ifndef PR_SET_TIMERSLACK
#define PR_SET_TIMERSLACK 29
#endif

#ifndef MS_BIND
#define MS_BIND 4096
#endif
#ifndef MS_REC
#define MS_REC 16384
#endif
#ifndef MS_PRIVATE
#define MS_PRIVATE (1<<18)
#endif
#ifndef MNT_DETACH
#define MNT_DETACH 2
#endif

/* --- GLOBALS --- */
static int g_pm_qos_fd = -1;
static const char *g_shm_path = DEFAULT_SHM_FILE;
static pid_t g_child_pid = -1;
static bool g_is_cgroup_v2 = false;

/* Fast state cache */
typedef struct {
    char path[128];
    char original_val[256];
    char target_val[256];
    bool is_mount_point;
} state_entry_t;

static state_entry_t g_state_cache[MAX_STATE_ENTRIES];
static int g_state_count = 0;

/* SHM Structure */
struct player_ctrl {
    atomic_uint_least32_t magic;              /* 0 */
    atomic_int_least32_t  command;            /* 4 */
    atomic_uint_least32_t seek_target;        /* 8 */
    atomic_uint_least32_t total_frames;       /* 12 */
    atomic_uint_least32_t current_frame;      /* 16 */
    atomic_int_least32_t  state;              /* 20 */
    atomic_uint_least32_t sample_rate;        /* 24 */
    atomic_uint_least32_t channels;           /* 28 */
    atomic_uint_least32_t bits;               /* 32 */
    atomic_uint_least32_t exact_total_frames; /* 36 */
    atomic_uint_least32_t hw_period_size;     /* 40 */
    atomic_uint_least32_t hw_buffer_size;     /* 44 */
    atomic_int_least32_t  hw_format;          /* 48 */
    atomic_int_least32_t  hw_access;          /* 52 */
    uint8_t _padding[64 - (14 * sizeof(atomic_uint_least32_t))]; /* Remainder: 8 bytes */
} __attribute__((aligned(64)));

_Static_assert(sizeof(struct player_ctrl) == 64, "player_ctrl structure size violation! Check padding.");

static struct player_ctrl *shm = NULL;
volatile atomic_int signal_event = 0;
static volatile atomic_int stop_flag = 0;

/* Standard Structures */
struct riff_wave_header {
    uint32_t riff_id;
    uint32_t riff_sz;
    uint32_t wave_id;
} __attribute__((packed));

struct chunk_header {
    uint32_t id;
    uint32_t sz;
} __attribute__((packed));

struct chunk_fmt {
    uint16_t audio_format;
    uint16_t num_channels;
    uint32_t sample_rate;
    uint32_t byte_rate;
    uint16_t block_align;
    uint16_t bits_per_sample;
} __attribute__((packed));

struct ctx {
    snd_pcm_t *pcm;
    int fd;
    int alsa_fd;
    uint8_t *map_start;
    size_t map_size;
    uint8_t *data_start;
    size_t data_size;
